<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class postsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->insert([
            'image' => 'best1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار',
        ]);
        DB::table('posts')->insert([
            'image' => 'best2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog1.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'best4.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رياضة',
        ]);
        DB::table('posts')->insert([
            'image' => 'blog1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'حوادث ومنوعات'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'تويتبوك'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog3.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog4.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد',
        ]);
        DB::table('posts')->insert([
            'image' => 'best2.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog6.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
        DB::table('posts')->insert([
            'image' => 'best1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار',
        ]);
        DB::table('posts')->insert([
            'image' => 'best2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog3.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'best4.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رياضة',
        ]);
        DB::table('posts')->insert([
            'image' => 'blog1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'حوادث ومنوعات'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'تويتبوك'
        ]);
        DB::table('posts')->insert([
            'image' => 'best1.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog4.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد',
        ]);
        DB::table('posts')->insert([
            'image' => 'best4.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog6.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
        DB::table('posts')->insert([
            'image' => 'best1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار',
        ]);
        DB::table('posts')->insert([
            'image' => 'best2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد'
        ]);
        DB::table('posts')->insert([
            'image' => 'best3.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog2.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رياضة',
        ]);
        DB::table('posts')->insert([
            'image' => 'blog1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'حوادث ومنوعات'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'تويتبوك'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog3.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog4.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد',
        ]);
        DB::table('posts')->insert([
            'image' => 'best1.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog6.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
        DB::table('posts')->insert([
            'image' => 'best1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار',
        ]);
        DB::table('posts')->insert([
            'image' => 'best2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد'
        ]);
        DB::table('posts')->insert([
            'image' => 'best1.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'best4.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رياضة',
        ]);
        DB::table('posts')->insert([
            'image' => 'blog1.jpg',
            'title' => 'الجنيه السوداني يسجل تراجعاً جديداً أمام الدولار',
            'body' =>  ' الجريدة: قوى الحرية: الموازنة لا تعبّر عن الشعب السوداني شحّ الوقود يهدّد الموسم الزراعي الشتوي بولاية النيل الأبيض قطوعات بالكهرباء في نيالا لعدم سداد مديونيات الشركة التركية مئات الآلاف يحتلفون بذكرى الثورة و”حمدوك” يعد بمحاسبة',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'حوادث ومنوعات'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog2.jpg',
            'title' => 'التجارة تتراجع أمام ازمة الخبز وتبحث تحديد تكلفة جديدة لجوال الدقيق',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'تويتبوك'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog3.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog4.jpg',
            'title' => 'المريخ يتغلب على الفلاح عطبرة بثنائية',
            'body' =>  'الخرطوم – باكر نيوز انتقدت وزيرة التعليم العالي انتصار صغيرون تدهور الاوضاع في مؤسسات التعليم العالي، وقالت إن التوسع جاء على حساب الجودة، وشددت على أن وزارتها تعتزم وضع أسس متينة تساعد الحكومة الديمقراطية بنهاية',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اقتصاد',
        ]);
        DB::table('posts')->insert([
            'image' => 'blog5.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'التيار: جهاز لتشويش المكالمات بمقرّ إقامة المخلوع بسجن كوبر مناوي للتيّار: بعد تشاد نسعى لضم مصرو إثيوبيا لوساطة السلام عشيّة تصدير الذهب..الدولار يوالي هبوطه الحرية والتغيير تطلب من الوساطة استبعاد غير حاملي السلاح من التفاوض',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'رأي'
        ]);
        DB::table('posts')->insert([
            'image' => 'blog2.jpg',
            'title' => 'قشة ما تعتر ليكم – حيدر المكاشفي',
            'body' =>  'الخرطوم:باكرنيوز أصدرت نيابة المال العام بولاية البحر الأحمر، أمر قبض في مواجهة رئيس الوزراء السابق محمد طاهر ايلا. ووجٌِه الأمر الصادر في السادس عشر من الشهر الجاري  لأي رجل شرطة بتنفيذ أمر القبض على المذكور ...',
            'slug' => 'mr',
            'auther' => 'نصر الدين الماس',
            'type' => 'اخبار'
        ]);
    }
}
